{"meta":{"title":"Hexo","subtitle":null,"description":null,"author":"Jeremy Hu","url":"http://yoursite.com"},"pages":[],"posts":[{"title":"谁说菜鸟不会数据分析-入门篇","slug":"谁说菜鸟不会数据分析-入门篇","date":"2018-05-10T11:58:48.924Z","updated":"2018-05-10T11:58:48.924Z","comments":true,"path":"2018/05/10/谁说菜鸟不会数据分析-入门篇/","link":"","permalink":"http://yoursite.com/2018/05/10/谁说菜鸟不会数据分析-入门篇/","excerpt":"","text":"#第一章 数据分析那些事儿 ##1.1 数据分析是“神马” 定义：指用适当的统计分析方法对收集来的大量数据进行分析，将它们加以汇总和理解并消化，以求最大地开发数据的功能，发挥数据的作用。是为了提取有用信息和形成结论而对数据加以详细研究和概括总结的过程。观测值：通过实验、测量、观察、调查等方式获取的结果，常常以数量的形式展示出来。 目的：把隐藏在一大批看似杂乱无章的数据背后的信息集中和提炼出来，总结出所研究对象的内在规律。在统计学领域，数据分析分为描述性数据分析、探索性数据分析、验证性数据分析 作用： 现状分析-过去发生了什么 原因分析-某一现状为什么发生 预测分析-将来会发生什么 ##1.2 数据分析六部曲 ###1. 明确分析目的和思路 ###2. 数据收集按照确定的数据分析框架，收集相关数据的过程 数据来源： 数据库 公开出版物 互联网 市场调查 ###3. 数据处理定义：指对收集到的数据进行加工整理，形成适合数据分析的样式。目的：从大量的、杂乱无章的、难以理解的数据中，抽取并推导出对解决问题有价值、有意义的数据内容：数据清洗、数据转换、数据提取、数据计算 ###4. 数据分析定义：指用适当的分析方法及工具，对处理过的数据进行分析，提取有价值的信息，形成有效结论的过程数据分析与数据处理的区别：数据处理是数据分析的基础。通过数据处理，将收集到的原始数据转换为可以分析的形式，并且保证数据的一致性和有效性。数据分析与数据挖掘的关系：数据挖掘侧重点：分类、聚类、关联和预测，重点在寻找模式和规律 ###5. 数据展现通过类似图表的形式将分析后得出的关系和规律展现出来 ###6. 报告撰写对整个数据分析过程的一个总结和呈现。 ##1.3 数据分析的三大误区 分析目的不明确，为分析而分析 缺乏业务知识，分析结果偏离实际 一味追求使用高级分析方法，热衷研究模型 ##1.4 数据分析师的职业发展 ###1.4.1 数据分析的广阔前景 ###1.4.2 数据分析师的职业要求 懂业务熟悉行业知识、公司业务及流程 懂管理一方面是搭建数据分析框架的要求另一方面是针对数据分析结论提出有指导意义的分析建议 懂分析指掌握数据分析的基本原理与一些有效的数据分析方法，并能灵活运用到实践工作中，以便有效地开展数据分析 懂工具指掌握数据分析相关的常用工具 懂设计指运用图表有效表达数据分析师的分析观点，使分析结果一目了然 ###1.4.3 数据分析师的基本素质 态度严谨负责 好奇心强烈 逻辑思维清晰 擅长模仿学习 勇于创新 ##1.5 几个常用指标和术语 平均数算数平均数-一组数据的算术平均值，即全部数据累加后除以数据个数 绝对数与相对数绝对数-反映客观现象总体在一定时间、地点条件下的总规模、总水平的综合性指标相对数-指由两个有联系的指标对比计算而得到的数值，用以反映客观现象之间数量联系程度的综合指标，计算公式：相对数=比较数值（比数）/基础数值（基数） 百分比与百分点百分比-相对数的一种百分点-指不同时期以百分数的形式表示的相对指标的变动幅度。 频数与频率频数-指一组数据中个别数据重复出现的次数频率-每组类别次数与总次数的比值，代表某类别在总体中出现的频繁程度 比例与比率比例-指在总体中各部分的数值占全部数值的比重，通常反映总体的构成和结构比率-指不同类别数值的对比，它反映的不是部分与整体之间的关系，而是一个整体中各部分之间的关系 倍数与番数倍数-一个数除以另一个数所得的商，一般表示数量的增长或上升幅度，而不适用于表示数量的减少或下降番数-指原来数量的2的N次方倍 同比与环比同比-指与历史同时期进行比较得到的数值，主要反映的是事物发展的相对情况环比-指与前一个统计期进行比较得到的数值，主要反映的是事物逐期发展的情况 ##1.6 本章小结 什么是数据分析及数据分析的三大作用 数据分析的六部曲：首先是明确分析目的和思路，然后是数据收集，第三步是将收集回来的数据进行处理，第四步是根据分析目的和思路进行数据分析，第五步是将分析出的结果通过图表的方式展现出来，最后一步是撰写数据分析报告 认识常见的数据分析误区，明白数据分析师的要求与基本素质，了解如何成为一个合格的数据分析师 数据分析中经常用到的指标和术语，除掌握最基本的平均数、百分比等概念以外，还需要将容易混淆的指标进行明确区分，避免在以后阐述分析结果时出现错误 学习：先了解，后深入；先记录，后记忆；先理论，后实践；先模仿，后创新； 方法：先思路，后方法；先框架，后细化；先方法，后工具；先思考，后动手 分析：先业务，后数据；先假设，后验证；先总体，后局部；先总结，后建议 #第二章 结构为王-确定分析思路 ##2.1 数据分析方法论 ###2.1.1 数据分析方法论与数据分析法的区别数据分析方法论-用来指导数据分析师进行一次完整的数据分析，它更多的是指数据分析思路。主要从宏观角度指导如何进行数据分析，就像是一个数据分析的前期规划，指导着后期数据分析工作的展开数据分析法-指具体的分析方法，主要从微观角度指导如何进行数据分析 ###2.1.2 数据分析方法论的重要性数据分析方法论的作用： 理顺分析思路，确保数据分析结果体系化 把问题分解成相关联的部分，并显示它们之间的关系 为后续数据分析的开展指引方向 确保分析结果的有效性及正确性 ##2.2 常用的数据分析方法论营销方面的理论模型：4P、用户使用行为、STP理论、SWOT管理方面的理论模型：PEST、5W2H、时间管理、生命周期、逻辑树、金字塔、SMART原则 ###2.2.1 PEST分析法PEST分析法用于对宏观环境的分析。宏观环境又称一般环境，是指影响一切行业和企业的各种宏观力量。一般对政治（Political）、经济（Economic）、技术（Technological）和社会（Social）这四大类影响企业的主要外部环境因素进行分析。 政治环境包括一个国家的社会制度，执政党的性质，政府的方针、政策、法令等。构成政治环境的关键指标有：政治体制、经济体制、财政政策、税收政策、产业政策、投资政策、专利数量、国防开支水平、政府补贴水平、民众对政治的参与度等。 经济环境 社会环境包括一个国家或地区的居民受教育程度和文化水平、宗教信仰、风俗习惯、审美观点、价值观点构成社会文化环境的关键指标：人口规模、性别比例、年龄结构、出生率、死亡率、种族结构、妇女生育率、生活方式、购买习惯、教育状况、城市特点、宗教信仰状况等因素 技术环境技术环境除了要考察与企业所处领域直接相关的技术手段的发展变化外，还应及时了解： 国家对科技开发的投资和支持重点 该领域技术发展动态和研究开发费用总额 技术转移和技术商品化速度 专利及其保护情况构成技术环境的关键指标：新技术的发明和进展、折旧和报废速度、技术更新速度、技术传播速度、技术商品化速度、国家重点支持项目、国家投入的研发费用、专利个数、专利保护情况等因素 ###2.2.2 5W2H分析法 ###2.2.3 逻辑树分析法又称问题树、演绎树或分解树等。将问题的所有子问题分层罗列，从最高层开始，并逐步向下扩展作用：帮助你理清自己的思路，避免进行重复和无关的思考使用原则： 要素化：把相同问题总结归纳成要素 框架化：将各个要素组织成框架，遵守不重不漏的原则 关联化：框架内的各要素保持必要的相互关系，简单而不孤立 ###2.2.4 4P营销理论 产品（Product）：指能够提供给市场，被人们使用和消费并满足人们某种需要的任何东西，包括有形产品、服务、人员、组织、观念或它们的组合 价格（Price）：指顾客购买产品时的价格，包括基本价格、折扣价格、支付期限等。影响定价的主要因素：需求、成本与竞争。 渠道（Place）：指产品从生产企业流转用户手上的全过程中所经历的各个环节 促销（promotion）：指企业通过销售行为的改变来刺激用户消费，以短期的行为促成消费的增长，吸引其他品牌的用户或导致提前消费促进销售的增长。 ###2.2.5 用户行为理论用户使用行为是指用户为获取、使用物品或服务所采取的各种行动，用户对产品首先需要一个认知、熟悉的过程，然后试用，再决定是否继续消费使用，最后成为忠诚用户。 2.3 本章小结 PEST分析理论主要用于行业分析 4P分析理论主要用于公司整体经营情况分析 逻辑树分析理论可用于业务问题专题分析 用户行为理论的用途较单一，就是用于用户行为研究分析 5W2H分析理论的用途相对广泛，可用于用户行为分析、业务问题专题分析等 #第三章 无米难为巧妇-数据准备 ##3.1 理解数据 ###3.1.1 字段与记录 字段-事物或现象的某种特征 记录-事物或现象某种特征的具体表现###3.1.2 数据类型 字符型数据不具有计算能力的文字数据类型 数值型数据直接使用自然数或度量单位进行计量的数值数据###3.1.3 数据表3.2 数据来源###3.2.1 导入数据 导入文本数据 自动导入网站数据###3.2.2 问卷录入要求 数值题 单选题 多选题 排序题 开放性文字题##3.3 本章小结 认识了数据的特点与要求，它是以字段和记录的形式存储在数据表中，数据类型主要有字符型和数值型两大类。了解了数据表的六点要求 熟悉了几种数据来源，学习了数据导入方法与调查问卷常见的五种题型及录入格式。#第四章 三心二意-数据处理##4.1 何为数据处理###4.1.1 “三心二意”处理数据 信心 细心 平常心 诚意 合意###4.1.2 数据处理的内容数据处理的步骤：第一步：数据清洗第二部：数据加工数据处理-根据数据分析的目的，将收集到的数据，用适当的处理方法进行整理加工，形成合适数据分析的要求样式。##4.2 数据清洗内容：清除掉不必要的重复数据、填充缺失的数据、检测逻辑错误的数据###4.2.1 重复数据的处理 函数法 高级筛选法 条件格式法 数据透视表法 删除重复数据方法一：通过菜单操作删除重复项方法二：通过排序删除重复项方法三：通过筛选删除重复项###4.2.2 缺失数据处理缺失值：指数据集中某个或某些属性的值是不完全的 定位输入处理缺失值的四种方法：一. 用一个样本统计量的值代替缺失值二. 用一个统计模型计算出来的值去代替缺失值三. 将有缺失值的记录删除，会导致样本量的减少四. 将有缺失值的记录保留，仅在相应的分析中做必要的排除 查找替换###4.2.3 检查数据逻辑错误 利用IF函数检查错误 利用条件格式标记错误##4.3 数据加工*4.3.1 数据抽取指保留原数据表中某些字段的部分信息，组合成一个新字段 字段分列 菜单法 函数法 字段合并 字段匹配出现错误标识符”#N/A“的情况： 数据存在空格，此时可以嵌套使用TRIM函数将空格批量删除 数据类型或格式不一致，此时将类型或格式转为一致即可###4.3.2 数据计算 简单计算 函数计算 平均值与总和 日期的加减法 用函数DATEDIF计算工龄###4.3.3 数据分组###4.3.4 数据转换 数据表的行列转换 多选题录入数据方式之间的转换##4.4 数据抽样普查是指对总体中的对象–进行观察、访问与记录，确定材料抽样调查是指从调查对象总体中按照随机原则选取一部分对象作为样本进行调查分析，以此推论总体状况的一种调查方法。 ##4.5 本章小结 做数据处理得要”三心两意“-信心、细心、平常心、诚意、合意，以及数据处理中的步骤和技巧，数据要处理得有条理，就得采用数据清洗和数据加工”两步走“战略 Excel中对重复数据、缺失数据和错误数据的处理方法，其中，需要重点掌握条件格式和查找/替换/定位的技巧 数据抽取、数据计算、数据分组和数据转换四大数据加工技巧 简单的数据抽样的方法，主要涉及RAND函数的使用 #第五章 工欲善其事必先利其器-数据分析 ##5.1 数据分析方法 ###5.1.1 对比分析法 定义指将两个或两个以上的数据进行比较，分析它们的差异，从而揭示这些数据所代表的事物发展变化情况和规律性。特点：可以非常直观地看出事物某方面的变化或差距，并且可以准确、量化地表示出这种变化或差距是多少 分类 静态比较-在同一时间条件下对不同总体指标的比较 动态比较-在同一总体条件下不同时期指标数值的比较 实践运用 与目标对比 不同时期对比 同级部门、单位、地区对比 行业内对比 活动效果对比 注意事项 指标的口径范围、计算方法、计量单位必须一致，即要用同一种单位或标准去衡量 对比的对象要有可比性 对比的指标类型必须一致 ###5.1.2 分组分析法定义：根据分析对象的特征，按照一定的标志（指标），把数据分析对象划分为不同的部分和类型来进行研究，以揭示其内在的联系和规律性。 ###5.1.3 结构分析法定义：指被分析总体内的各部分与总体之前进行对比的分析方法，即总体内各部分占总体的比例，属于相对指标。结构相对指标（比例）的计算公式：结构相对指标（比例）=（总体某部分的数值/总体总量）100%市场占有率=（某种商品销售量/该种商品市场销售总量）100% ###5.1.4 平均分析法定义：运用计算平均数的方法来反映总体在一定时间、地点条件下某一数量特征的一般水平。作用： 利用平均指标对比同类现象在不同地区、不同行业、不同类型单位等之间的差异程度，比用总量指标对比更有说服力 利用平均指标对比某些现象在不同历史时期的变化，更能说明其发展趋势和规律算数平均算数平均数=总体各单位数值的总和/总体单位个数 ###5.1.5 交叉分析法定义：同时将两个有一定联系的变量及其值交叉排列在一张表格内，使各变量值成为不同变量的交叉结点，形成交叉表，从而分析交叉表中变量之间的关系 ###5.1.6 综合评价分析法五个步骤：三个特点： 数据标准化-将数据按比例缩放，使之落入一个小的特定区间。0-1标准化：第N个经标准化处理的值=（第N个原始值-最小值）/（最大值-最小值） 权重确定方法专家访谈法、德尔菲法、层次分析法、主成分分析法、因子分析法、回归分析法目标优化矩阵法：工作原理：把人脑的模糊思维，简化为计算机的1/0式逻辑思维，最后得出量化的结果。用途：用于目标的优化，用于任何项目的排序用法：将纵轴上的项目一次与横轴上的项目对比，由专家进行投票表决，如果纵轴上的项目比横轴上的项目重要，那么在两个项目相交的格子中填”1“，否则填”0“，最后将每行数据相加，根据合计的数值进行排序计算权重：某指标权重=（某指标新的重要性合计得分/所有指标新的重要性合计得分）*100%###5.1.7 杜邦分析法特点：将若干个用以评价企业经营效率和财务状况的比率按其内在联系有机地结合起来，形成一个完整的指标体系，并最终通过权益率来综合反映 ###5.1.8 漏斗图分析法主要以漏斗图的形式展现分析过程及结果，适合业务流程比较规范、周期比较长、各流程环节设计复杂业务过程比较多的管理分析工具。 ###5.1.9 矩阵关联分析法矩阵分析法-根据事物（如产品、服务等）的两个重要属性（指标）作为分析的依据，进行分类关联分析，找出解决问题的一种分析方法。 发展矩阵 改变难易矩阵 举一反三 ###5.1.10 高级数据分析法 ##5.2 数据分析工具 ###5.2.1 初识数据透视表 ###5.2.2 创建数据透视表的三步法 ###5.2.3 数据透视表分析实践 ###5.2.4 数据透视表小技巧 百分比计算 同比、环比计算 数据分组统计 ###5.2.5 多选题分析 ##5.3 本章小结 数据分析三大作用对应的基本分析法，以及由基本方法发展而来的对比分析、分组分析、结构分析、平均分析、交叉分析、综合评分分析、杜邦分析、漏斗图分析、矩阵关联分析等数据分析法，并且在矩阵分析的基础上进行发散性思考，学会举一反三学习数据分析法 Excel中数据分析工具-数据透视表，并且我通过三个实用的数据透视表小技巧，介绍了如何利用数据透视表实现多选题分析 #第六章 给数据量体裁衣-数据展现 ##6.1 揭开图表的真面目 ###6.1.1 图表的作用 表达形象化 突出重点 体现专业化###6.1.2 经济适用图标有哪些 ###6.1.3 通过关系选择图表数据间关系的类型：成分、排序、时间序列、频率分布、相关性、多重数据比较 成分也叫构成，用于表示整体的一部分，一般情况下用饼图表示 排序根据需要比较的项目的数值大小进行排列 时间序列用于表示某事按一定的时间顺序发展的走势、趋势 频率分布表示各项目、类别间的比较 *相关性用于衡量两大类中各项目间的关系，即观察其中一类的项目大小是否随着另一类项目大小有规律地变化 多重数据比较指数据类型多于2个的数据比较雷达图表示 ###6.1.4 图表制作五步法 ##6.2 表格也疯狂 ###6.2.1 突出显示单元格根据指定的规则，把表格中符合条件的单元格用不同颜色背景、字体颜色将数据突出显示出来。 ###6.2.2 项目选取 ###6.2.3 数据条 ###6.2.4 图标集 ###6.2.5 迷你图 ##6.3 给图表换装 ###6.3.1 平均线图 ###6.3.2 双坐标图 ###6.3.3 竖形折线图 ###6.3.4 瀑布图 ###6.3.5 帕累托图 ###6.3.6 旋风图 同一事物在某个活动、行为影响前后不同指标的变化 同一事物在某个条件变化下（指标A的变化），指标B受影响也随之变化，具有因果关系 两个类别之间不同指标的比较 ###6.3.7 人口金字塔图 ###6.3.8 漏斗图 ###6.3.9 矩阵图（散点图） ###6.3.10 发展矩阵图 ###6.3.11 改进难易矩阵（气泡图） ##6.4 本章小结 图表在数据分析中的作用，饼图、柱形图、折线图、条形图等经济适用图表的作用与特点，通过所要表达的关系选择恰当的图表，以及制作图表的五步法 表格中突出显示单元格、项目选取、数据条、图标集、迷你图等几种展现数据的表格技巧 平均线图、双坐标图、竖行折线图、瀑布图、帕累托图、旋风图、人口金字塔图、漏斗图、矩阵图等图表分析技巧 第七章 专业化生存-图表可以更美的7.1 别让图表犯错7.1.1 让图表”五脏俱全“7.1.2 要注意的条条框框首先，避免生出无意义的图表第二点，不要把图表撑破第三点，只选对的，不选复杂的第四点，一句话标题 饼图对于饼图要按照时钟表的刻度，把数据从12点钟的位置开始排列，最重要的成分紧靠12点钟的位置数据项不要太多，保持在5项以内不要使用爆炸式的”饼图分离“饼图不要使用图例尽量不使用标签连线，如果要用则切忌凌乱尽量不使用3D效果，如果要用厚度要尽量薄一些当扇区使颜色填充时，推荐使用白色的边框线，具有较好的切割感没有从12点钟的位置开始排列使用了”饼图分离“效果使用了图例，确实不便于阅读使用了3D效果，如果图中没有标出数字的话，我就不知道哪个大、哪个小了标题没有反映出图表主题 复合饼图 柱形图同一数据序列使用相同的颜色不要使用倾斜的标签，别让读者歪着脑袋看纵坐标轴一般刻度从0开始柱形图最好添加数据标签如果柱形图已经有了数据标签，纵坐标刻度线和网格线则显得多余了，最好删除 条形图同一数据序列使用相同的颜色尽量让数据由大到小排序不要使用倾斜的标签最好添加数据标签 折线图折线选用的线型要相对粗些，最好比网格线、坐标轴等更突出线条一般不超过5条。如果线条太多的话可以分开做图表不要使用倾斜的标签纵坐标轴一般刻度从0开始 7.1.3 图表会说谎 虚张声势的增长 3D效果的伪装 逆序排列的失误 一维图形的障眼法 7.2 浓妆淡抹总相宜-图表美化7.2.1 图表美化的三原则 简约 整洁 对比 7.2.2 略施粉黛-美化图表的技巧 最大化数据墨水比 找出隐形的线 图表喜欢的数字格式 如何突出对比 7.2.3 图表也好”色“ 色彩的C大调相似色邻近色对比色冷暖色 慎用的颜色 7.3 如虎添翼的招儿7.3.1 我的图表模板7.3.2 快速制表7.3.3 添加标签小工具7.3.4 修剪超大值7.4 本章小结 图表的基本组成要素，制作图表时的注意事项，并且举出了一些在报纸、杂志、网站上故意夸大事实或者隐瞒事实的图表，让你看到图表背后的真相，并引以为戒不犯同样的错误 图表最大化数据墨水比原则、图表配色等图表美化技巧 专业图表的制作技巧 第八章 专业的报告-体现你的职场价值8.1 初始数据分析报告8.1.1 数据分析报告是什么根据数据分析原理和方法，运用数据来反映、研究和分析某项事物的现状、问题、原因、本质和规律，并得出结论，提出解决办法的一种分析应用文体 8.1.2 数据分析报告的写作原则 ###8.1.3 数据分析报告的作用主要目的在于将分析结果、可行性建议以及其他有价值的信息传递给管理人员。它需要对数据进行适当的包装，让阅读者能对结果做出正确的理解与判断，并可以根据其做出有针对性、操作性、战略性的决策。 ###8.1.4 数据分析报告的种类 专题分析报告作用：为决策者制定某项政策、解决某个问题提供决策参考和依据 单一性 深入性 综合分析报告 全面性 联系性 日常数据通报 进度性 规范性 时效性 ##8.2 数据分析报告的结构在数据分析报告结构中，“总-分-总”结构的开篇部分包括标题页、目录和前沿（主要包括分析背景、目的与思路）；正文部分主要包括具体分析过程与结果；结尾部分包括结论、建议及附录。 ###8.2.1 标题页 标题常用的类型 解释基本观点 概括主要内容 交代分析主题 提出问题 标题的制作要求 直接 确切 简洁 标题的艺术性 ###8.2.2 目录 ###8.2.3 前言主要包括分析背景、目的及思路三方面，即： 为了要开展此次分析？有何意义？ 通过此次分析要解决什么问题？达到何种目的？ 如何开展此次分析？主要通过哪几方面开展？ 分析背景 分析目的 分析思路 ###8.2.4 正文特点： 是报告最长的主体部分 包含所有数据分析事实和观点 通过数据图表和相关的文字结合分析 正文各部分具有逻辑关系 ###8.2.5 结论与建议 ###8.2.6 附录 ##8.3 撰写报告时的注意事项 结构合理，逻辑清晰 实事求是，反映真相 用词准确，避免含糊 篇幅适宜，简洁有效 结合业务，分析合理 ##8.4 报告范例 8.5 本章小结 数据分析报告的三大作用，即展示分析结果、验证分析质量，以及为决策者提供参考依据，还有规范性、重要性、谨慎性以及创新性四项基本原则 数据分析报告的三种常用报告类型，即专题分析报告、综合分析报告、日常数据通报，以及各自的特点 数据分析报告的标题、目录、前言、正文、结论与建议、附录六大组成部分及特点 撰写数据分析报告的五大注意事项：第一，合理的结构以及清晰的逻辑；第二，实事求是，反映真相；第三，用词准确，避免含糊；第四，篇幅适宜，简介有效；第五，结合具体业务进行合理的分析","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2018-01-31T01:22:05.462Z","updated":"2018-01-31T01:22:05.462Z","comments":true,"path":"2018/01/31/hello-world/","link":"","permalink":"http://yoursite.com/2018/01/31/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}